task-2/results/logs/ResultSummary_2025-05-01T21-09-44-723Z.txt
     █ page_1 - https://k6.io/

     █ page_2 - https://grafana.com/docs/k6/latest

     data_received..................: 279 MB 1.9 MB/s
     data_sent......................: 5.5 MB 38 kB/s
     group_duration.................: avg=16.71s   min=12.41s   med=14.96s   max=39.1s    p(90)=21.78s   p(95)=29.71s  
     http_req_blocked...............: avg=27.24ms  min=0s       med=0s       max=1.57s    p(90)=9.11µs   p(95)=319.52ms
     http_req_connecting............: avg=10.45ms  min=0s       med=0s       max=1.13s    p(90)=0s       p(95)=105.72ms
   ✓ http_req_duration..............: avg=222.16ms min=103.85ms med=235.57ms max=3.55s    p(90)=308.34ms p(95)=383.63ms
       { expected_response:true }...: avg=225.49ms min=104.8ms  med=238.25ms max=3.55s    p(90)=309.91ms p(95)=384.83ms
     http_req_failed................: 6.71%  ✓ 540       ✗ 7500
     http_req_receiving.............: avg=15.11ms  min=0s       med=510.55µs max=3.4s     p(90)=20.77ms  p(95)=66.73ms 
     http_req_sending...............: avg=27.72µs  min=0s       med=0s       max=3.53ms   p(90)=0s       p(95)=146.4µs 
     http_req_tls_handshaking.......: avg=15.68ms  min=0s       med=0s       max=376.06ms p(90)=0s       p(95)=169.75ms
     http_req_waiting...............: avg=207.02ms min=103.85ms med=224.06ms max=1.25s    p(90)=284.58ms p(95)=328.61ms
     http_reqs......................: 8040   54.541734/s
     iteration_duration.............: avg=35.43s   min=29.88s   med=31.92s   max=54.13s   p(90)=46.29s   p(95)=51.31s  
     iterations.....................: 60     0.407028/s
     vus............................: 1      min=1       max=20
     vus_max........................: 20     min=20      max=20